---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RuledFace
source: html/83f4ea16-e2b8-ba1f-94a7-81c87a99908e.htm
---
# RuledFace Members

Returns the first partial derivatives of the underlying surface at the specified point.